
## Plan Result (aat)




<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.web_pubsub_service_owner[&#34;3689a22e-1785-4944-bd9e-113355bfb070&#34;]
* Update
  * azurerm_private_endpoint.ped_web_pubsub_private_endpoint
  * module.em-icp-redis-cache[0].azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_private_endpoint.ped_web_pubsub_private_endpoint will be updated in-place
  ~ resource "azurerm_private_endpoint" "ped_web_pubsub_private_endpoint" {
        id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/privateEndpoints/em-icp-aat-privateendpoint"
        name                          = "em-icp-aat-privateendpoint"
      ~ tags                          = {
          - "application"  = "core" -> null
          - "builtFrom"    = "hmcts/aks-cft-deploy" -> null
          - "businessArea" = "CFT" -> null
          - "environment"  = "staging" -> null
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_role_assignment.web_pubsub_service_owner["3689a22e-1785-4944-bd9e-113355bfb070"] will be created
  + resource "azurerm_role_assignment" "web_pubsub_service_owner" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3689a22e-1785-4944-bd9e-113355bfb070"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Web PubSub Service Owner"
      + scope                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-icp-aat/providers/Microsoft.SignalRService/webPubSub/em-icp-webpubsub-aat"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.em-icp-redis-cache[0].azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                                 = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-icp-redis-cache-cache-aat/providers/Microsoft.Cache/redis/em-icp-redis-cache-aat"
        name                               = "em-icp-redis-cache-aat"
        tags                               = {
            "application"         = "evidence-management"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/em-icp-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#em-dev-chat"
            "environment"         = "staging"
            "managedBy"           = "Evidence Management"
        }
        # (24 unchanged attributes hidden)

      ~ redis_configuration {
          - data_persistence_authentication_method  = "SAS" -> null
          ~ maxfragmentationmemory_reserved         = 125 -> 642
          ~ maxmemory_delta                         = 125 -> 642
          ~ maxmemory_reserved                      = 125 -> 642
            # (13 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1473,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->